# ===================  Home work 10 ========================

# +++++++++++++++++++++++++++++  Основи роботи з класами # Об'єктноорієнтоване програмування (ООП) ++++++++++++++++++++++++++++++++++++++

#                     1. Визначення та створення класу
#                     2. Створення об'єктів
#                     3. Атрибути класу (поля та методи)
#                     4. Конструктор класу
#                     5. Наслідування
#                     6. Method Resolution Order (MRO).
#                     7. Контейнери, створені за допомогою наслідування (UserList, UserDict, UserString).
#                     8. Власні винятки
#                     9. Поліморфізм / Качина типізація


# ================================ Звдання 1 / Task 1 ======================================

# ================================  Визначення та створення класу. ==========================

# Спосіб організації програм, коли об'єднують дані та функціонал усередині якогось об'єкта, 
# називають об'єктноорієнтованою парадигмою програмування.
# Об'єктноорієнтоване програмування (ООП) по праву вважається однією з найефективніших методологій створення програмних продуктів.
# Ви пишете класи, що описують реально чинні предмети та ситуації, а потім створюєте об'єкти на основі цих описів.

# Покажемо найпростіший клас на наступному прикладі.

# class Person:
#     pass  # Порожній блок


# p = Person()
# Ми створюємо новий клас за допомогою оператора class та імені класу. За цим слідує блок виразів, 
# що формують тіло класу. В нашому випадку блок у нас порожній, на що вказує оператор pass.
# Далі ми створюємо об'єкт-екземпляр класу, записуючи ім'я класу з дужками.

# ООП має чотири основні концепції, які відрізняють його від інших методологій програмування:

# Абстракція
# Інкапсуляція
# Наслідування
# Поліформізм
# З чотирьох концепцій ми розберемо у завданнях три останні, крім абстракції. 
# Це більш просунута категорія, і створення абстрактних класів ми розглядатимемо в другому блоці навчання. 
# Зараз нагадаю йде перший блок Python. Коротко тільки зауважимо, що:

# Абстракція - це модель якогось об'єкта або явища з реального світу, що відкидає незначні деталі, 
# які не грають істотну роль в цьому контексті.

# ++++++++++++++++++++++++++++++++++++++Умова / Condition ++++++++++++++++++++++++++++++++++++++++

# Створіть клас Animal. 
# Також створіть екземпляр класу Animal (замість реалізації класу можете використовувати pass) і привласніть змінній animal.


# ++++++++++++++++++++ Код / Code ++++++++++++++++++++++++++++++++++++

class Animal:  # створення класу , де *class - вбудована функція для  оголошення класу , *Animal імя класу який створюємо.
   pass        # якщо в реалізації класу є тільки оператор *pass - то це пустий клас. Реалізація класу - це як код оголошення функції , 
               # Починається після двокрапки з нового рядка і з відступом в табуляцію або 4 пробіли. 

animal = Animal() # зміній *animal присвоюємо пустий екземпляр класу *Animal 


# ================================ Звдання 2 / Task 2 ======================================

# ================================   Створення об'єктів ==========================

# ++++++++++++++++++++++++++++++++++++++Умова / Condition ++++++++++++++++++++++++++++++++++++++++

# ++++++++++++++++++++ Код / Code ++++++++++++++++++++++++++++++++++++

